In [ ]:
python libraries - numpy,matplotlib,seaborn,pandas

numpy - data manipulation(matrix)
pandas  - data processing,cleaning,manipulation
seaborn, matplotlib - data visualization

Data - data analyse, data cleaning , data processing ,data visualize

In [3]:
import pandas as pd
dict1 = {'name':['a','b','c'],'age':[4,6,3]}
df = pd.DataFrame(dict1)
df.head()

  name  age
0    a    4
1    b    6
2    c    3

In [5]:
df['birthday']=[6,2,19]
df

  name  age  birthday
0    a    4         6
1    b    6         2
2    c    3        19

In [6]:
import pandas as pd
dict1 = {'name':['d'],'age':[4]}
df_new = pd.DataFrame(dict1)

In [10]:
df_new

  name  age
0    d    4

In [53]:
df_1 = df.append(df_new)
df_1 = df_1.reset_index()

C:\Users\Smritik Sadhukhan\AppData\Local\Temp\ipykernel_27832\1182589186.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_1 = df.append(df_new)

In [59]:
df_1 = df_1.drop(['index','age'],axis=1)
df_1

  name  birthday
0    a       6.0

In [18]:
type(df_1['birthday'].values[-1])

numpy.float64

In [20]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 0
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   age       4 non-null      int64
 2   birthday  3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [28]:
df_1

  name  age  birthday
0    a    4       6.0
1    b    6       2.0
2    c    3      19.0
3    d    4       NaN

In [30]:
df_1.dropna()

  name  age  birthday
0    a    4       6.0
1    b    6       2.0
2    c    3      19.0

In [31]:
df_1 = df_1.fillna(0)
df_1

  name  age  birthday
0    a    4       6.0
1    b    6       2.0
2    c    3      19.0
3    d    4       0.0

In [39]:
df_1['birthday']=df_1['birthday'].apply(lambda x:int(x))

In [40]:
df_1

  name  age  birthday
0    a    4         6
1    b    6         2
2    c    3        19
3    d    4         0

In [41]:
df_1['birthday'].astype(int)

0     6
1     2
2    19
3     0
Name: birthday, dtype: int32

In [43]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   age       4 non-null      int64
 2   birthday  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [44]:
df_1.describe()

            age   birthday
count  4.000000   4.000000
mean   4.250000   6.750000
std    1.258306   8.539126
min    3.000000   0.000000
25%    3.750000   1.500000
50%    4.000000   4.000000
75%    4.500000   9.250000
max    6.000000  19.000000

In [46]:
df_1

  name  age  birthday
0    a    4         6
1    b    6         2
2    c    3        19
3    d    4         0

In [60]:
df

  name  age  birthday
0    a    4         6
1    b    6         2
2    c    3        19

In [103]:
df.loc[[0,1,2],['name']]

  name
0    a
1    b
2   dd

In [112]:
df.iloc[:3,0:2]

  name  age
0    a    4
1    b    6
2   dd    3

In [115]:
df[['name','age']]

  name  age
0    a    4
1    b    6
2   dd    3

In [86]:
df['birthday']=df['birthday'].replace(1000,10)
# for i in df['birthday'].values:
#     if i==100:
#         df['birthday'] = 1000
# df
df

  name  age  birthday
0    a    4         6
1    b    6        10
2   dd    3        19

In [92]:
for i in df.values:
    print(i,i[2])
    if i[1]==6:
        print(i[0])

['a' 4 6] 6
['b' 6 10] 10
b
['dd' 3 19] 19

In [69]:
# df.loc[inden name, column name]
# df

In [72]:
df.iloc[1,2] = 100

In [75]:
df['birthday'].describe()

count      3.000000
mean      41.666667
std       50.934599
min        6.000000
25%       12.500000
50%       19.000000
75%       59.500000
max      100.000000
Name: birthday, dtype: float64

In [94]:
df.to_csv('demo.csv')

In [99]:
df_read  = pd.read_csv('demo.csv')
df_read = df_read.drop(['Unnamed: 0'],axis=1)
df_read

  name  age  birthday
0    a    4         6
1    b    6        10
2   dd    3        19